---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InsertOrientation
source: html/9c90f3c9-4d8a-af2c-270f-383f66268ea7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InsertOrientation Property

"Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId InsertOrientation { get; }
```